{
  "Season 4": {
    "release_year": 2020,
    "episodes": [
      {
        "title": "Episode 4.1",
        "description": "Learning of weakened defenses at Bebbanburg due to Scottish attacks, Uhtred plans to seize his birthright, but Edward refuses assistance."
      },
      {
        "title": "Episode 4.2",
        "description": "Approaching Bebbanburg, Uhtred faces the return of prodigal son Wihtgar with unexpected tricks. News of Cnut's treachery reaches Wessex."
      },
      {
        "title": "Episode 4.3",
        "description": "Suffering an unbearable loss in the attack on Bebbanburg, Uhtred captures valuable prisoners during the retreat south. Æthelflæd prepares for war."
      },
      {
        "title": "Episode 4.4",
        "description": "Hoping for Edward's troops, Æthelflæd and Uhtred ally with the Welsh against Cnut's thousand-warrior army in the Battle of Tettenhall."
      },
      {
        "title": "Episode 4.5",
        "description": "A repentant Æthelred nears death, and his ealdormen vie for control of Mercia. Edward uses his niece Ælfwynn as a bargaining chip."
      },
      {
        "title": "Episode 4.6",
        "description": "Eardwulf and his men pursue Uhtred's party through a disease-ravaged countryside. Tensions rise between Edward and the Mercians."
      },
      {
        "title": "Episode 4.7",
        "description": "Ælfwynn suffers from a sweeping sickness. Edward proposes an unexpected path forward for Mercia. Brida is freed by Cnut's kinsman."
      },
      {
        "title": "Episode 4.8",
        "description": "Uhtred reluctantly prepares to take power in Mercia but secretly formulates an alternate plan. Brida joins the Danes in attacking the Welsh."
      },
      {
        "title": "Episode 4.9",
        "description": "Danes under Brida and Sigtryggr sack Winchester, guided by traitor Eardwulf. Hæsten ambushes Uhtred's party and seizes valuable captives."
      },
      {
        "title": "Episode 4.10",
        "description": "Edward besieges Winchester, awaiting Æthelflæd's reinforcements, but Uhtred remains unconvinced that Sigtryggr's ultimate aim is conquest."
      }
    ]
  }
}
