{
  "Season 5": {
    "release_year": 2022,
    "episodes": [
      {
        "title": "Episode 5.1",
        "description": "Ill omens and border raids make Uhtred extra-vigilant at his northern outpost. King Sigtryggr is visited by his notorious brother Rognvaldr."
      },
      {
        "title": "Episode 5.2",
        "description": "A betrayal at Eoferwic sends Sigtryggr in search of aid, while Uhtred appeals to Æthelflæd for military support she cannot provide. Edward meets a new ally."
      },
      {
        "title": "Episode 5.3",
        "description": "In the aftermath of the tragic battle for Eoferwic, Sigtryggr is forced to make a painful choice. Edward learns of Æthelhelm's intrigues in Mercia."
      },
      {
        "title": "Episode 5.4",
        "description": "Rivals secretly promote competing successors upon the death of a Mercian ruler. Brida finds solace in the faith of her prisoner, Father Pyrlig."
      },
      {
        "title": "Episode 5.5",
        "description": "Æthelhelm's subterfuge successfully stirs war tensions between Edward and Sigtryggr, but his thugs make a crucial mistake in attacking a pilgrimage."
      },
      {
        "title": "Episode 5.6",
        "description": "Forces of Edward and Sigtryggr march toward battle as Uhtred races to reveal the truth of Æthelhelm's scheming and avert a ruinous war."
      },
      {
        "title": "Episode 5.7",
        "description": "Edward offers a role to Stiorra that would restore her to power. Æthelhelm meets with a Saxon enemy. Uhtred has a long-overdue reckoning with Brida."
      },
      {
        "title": "Episode 5.8",
        "description": "Learning of Æthelhelm's location, Uhtred proposes an audacious attack to rescue Ælfwynn and restore his birthright, but Edward is cautious."
      },
      {
        "title": "Episode 5.9",
        "description": "Edward marches his troops north, while Uhtred recruits a small force to infiltrate Bebbanburg. King Constantin arrives to meet his new bride, Ælfwynn."
      },
      {
        "title": "Episode 5.10",
        "description": "Armies converge in an epic, final showdown that determines the fate of a king's dream for England and Uhtred's hope of securing his family's future."
      }
    ]
  }
}
