{
  "Season 3": {
    "release_year": 2018,
    "episodes": [
      {
        "title": "Episode 3.1",
        "description": "Concerned about his health and legacy, Alfred sends Uhtred to confront a new threat: the fierce Danish warrior Bloodhair and his sorceress, Skade."
      },
      {
        "title": "Episode 3.2",
        "description": "Falling out of favor with Alfred, Uhtred flees north to his brother, Ragnar. Æthelwold, eyeing the throne, begins assembling an alliance to strike Wessex."
      },
      {
        "title": "Episode 3.3",
        "description": "Bloodhair and Æthelwold attempt to coax Uhtred into their alliance against Alfred. Fearing for her life, Æthelflæd turns to Father Beocca for aid."
      },
      {
        "title": "Episode 3.4",
        "description": "Uhtred focuses on Æthelflæd's plight. Alfred forces Edward to face his duty. Ragnar's army marches, but traitors emerge from within."
      },
      {
        "title": "Episode 3.5",
        "description": "A deadly betrayal threatens to splinter Ragnar's army. Uhtred devises a cunning battle plan and finds an unexpected ally in young Edward."
      },
      {
        "title": "Episode 3.6",
        "description": "Edward makes a kingly decision. Alfred plans for his son's future reign. Æthelwold faces a treacherous task. Uhtred and Brida seek out a seer."
      },
      {
        "title": "Episode 3.7",
        "description": "A message from Uhtred and Skade's machinations exploit divisions among the Danes. Alfred, with failing health, wrestles with Æthelwold's fate."
      },
      {
        "title": "Episode 3.8",
        "description": "Uhtred risks returning to Wessex to fulfill his vow to Brida. As the royal wedding approaches, Æthelwold spreads discord from the shadows."
      },
      {
        "title": "Episode 3.9",
        "description": "At the end of his days, Alfred confides in Uhtred about his plans for Edward's uncertain future, but Ælswith charts a different course."
      },
      {
        "title": "Episode 3.10",
        "description": "As a climactic battle with the Danes looms, untested Edward faces dire decisions about the fates of Uhtred, Wessex, and England."
      }
    ]
  }
}
